// Задача создать функцию, которая принимает в качестве аргумента строку, состояющую из букв, и 
// возвращающую массив индексов всех заглавных букв в строке.
//
// Пример: "НовыйВек" = [0, 5]

Функция ПроверкаВерхнегоРегистра(ПроверяемаяБуква)
	
	ВВерхнийРегистр = ВРег(ПроверяемаяБуква);
	Возврат ВВерхнийРегистр = ПроверяемаяБуква;    
	
КонецФункции      

Функция ВозвратИндексовВРег(Строка)
	
	МассивИндексов = Новый Массив;
	СчетчикИндексов = 0;    

	Для Индекс = 1 По СтрДлина(Строка) Цикл   
						
		Если ПроверкаВерхнегоРегистра(Сред(Строка, Индекс, 1)) = Истина Тогда
			МассивИндексов.Добавить(СчетчикИндексов);			
		КонецЕсли;        
		
		СчетчикИндексов = СчетчикИндексов + 1;
		
	КонецЦикла;    
	
	Возврат МассивИндексов;
	
КонецФункции  
 
ВозвратИндексовВРег("АбВ"); // [0, 2]
ВозвратИндексовВРег("АБВ"); // [0, 1, 2]  
ВозвратИндексовВРег("абв"); // []