// Возвращает новую строку состоящую из неповторяющихся символов переданной строки
// Удаляет пробелы
//
// Параметры:
// 	ИсходнаяСтрока - Строка
//
// Возвращаемое значение:
// 	Строка
//
// Пример:
// 	УдалениеПовторяющихсяСимволовИПробелов("абв авг бд") = "абвгд"
Функция УдалениеПовторяющихсяСимволовИПробелов(ИсходнаяСтрока)
	
	СтрокаРезультат = "";
	
	ДлинаСтроки = СтрДлина(ИсходнаяСтрока);
	
	Для Счетчик = 1 По ДлинаСтроки Цикл
		
		ТекущийСимвол = Сред(ИсходнаяСтрока, Счетчик, 1);
		
		Если ТекущийСимвол = " " Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрНайти(СтрокаРезультат, ТекущийСимвол) = 0 Тогда
			СтрокаРезультат = СтрокаРезультат + ТекущийСимвол;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтрокаРезультат;
	
КонецФункции