// Функция принимает массив чисел и возвращает новый массив
// включающий минимальное и максимальное число из переданного массива.
// Если в переданном массиве меньше двух элементов, функция возвратит массив
// состоящий из двух элементов с типом Неопределено.
//
// Параметры:
//  <Параметр1>  - Массив чисел
//
// Возвращаемое значение:
//   Массив
//
Функция МинимумИМаксимумМассива(МассивЧисел)
	
	МассивРезультат = Новый Массив(2);
	
	Если МассивЧисел.Количество() < МассивРезультат.Количество() Тогда
		Возврат МассивРезультат;
	КонецЕсли;
	
	МинимальноеЧисло = Неопределено;
	МаксимальноеЧисло = 0;
	
	Для Каждого Число Из МассивЧисел Цикл
		
		Если (МинимальноеЧисло = Неопределено) ИЛИ (МинимальноеЧисло > Число) Тогда
			МинимальноеЧисло = Число;
		КонецЕсли;
		
		Если МаксимальноеЧисло < Число Тогда
			МаксимальноеЧисло = Число;
		КонецЕсли;
		
	КонецЦикла;
	
	МассивРезультат[0] = МинимальноеЧисло;
	МассивРезультат[1] = МаксимальноеЧисло;
	
	Возврат МассивРезультат;
	
КонецФункции