// Функция принимает массив чисел и возвращает массив без числовых дублей
//
// Параметры:
//  МассивЧисел - Числа - Массив чисел
//
// Возвращаемое значение:
//  Массив - Числа - Массив чисел без дублей
Функция УдалениеДублейИзМассива(МассивЧисел)
	
	МассивБезДублей = Новый Массив;
	
	Для Каждого Число Из МассивЧисел Цикл
		
		Если МассивБезДублей.Количество() = 0 Тогда
			МассивБезДублей.Добавить(Число);
		КонецЕсли;
		
		Если МассивБезДублей.Найти(Число) = Неопределено Тогда
			МассивБезДублей.Добавить(Число);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивБезДублей;
	
КонецФункции